1:PetTalents
00000000

Relentless
00000001

Mighty
00000002

Brilliant
00000003

Thinkin' Cap
00000004

Powerful
00000005

Unshakeable
00000006

Cunning
00000007

Early Bird
00000008

Refreshed
00000009

Best of Show
00000010

Cautious
00000011

Vigorous
00000012

Perceptive
00000013

Resourceful
00000014

Capable
00000015

Durable
00000016

Tenacious
00000017

Astute
00000018

Crafty
00000019

Spirited
00000020

Tireless
00000021

Efficient
00000022

Well Trained
00000023

Courageous
00000024

Stalwart
00000025

Vigilant
00000026

Dashing
00000027

Intuitive
00000028

Gifted
00000029

Careful
00000030

Steadfast
00000031

Rugged
00000032

Sharp
00000033

Canny
00000034

Eager
00000035

Determined
00000036

Effective
00000037

Sturdy
00000038

Intrepid
00000039

Adroit
00000040

Dependable
00000041

Effervescent
00000042

Attentive
00000043

Quick-Witted
00000044

Forceful
00000045

Dogged
00000046

Hearty
00000047

Calculating
00000048

Wise
00000049

Cheeky
00000050

Death-Away
00000051

Death-Proof
00000052

Life-Away
00000053

Life-Proof
00000054

Myth-Away
00000055

Myth-Proof
00000056

Balance-Off
00000057

Unbalancer
00000058

Fire-Away
00000059

Fire-Proof
00000060

Ice-Away
00000061

Ice-Proof
00000062

Storm-Away
00000063

Storm-Proof
00000064

Spell-Defying
00000065

Spell-Proof
00000066

Death-Boon
00000067

Death-Giver
00000068

Life-Boon
00000069

Life-Giver
00000070

Myth-Boon
00000071

Myth-Giver
00000072

Equalizer
00000073

Add Balance
00000074

Fire-Boon
00000075

Fire-Giver
00000076

Ice-Boon
00000077

Ice-Giver
00000078

Storm-Boon
00000079

Storm-Giver
00000080

Pain-Bringer
00000081

Pain-Giver
00000082

PetTalents_00000082
00000083

PetTalents_00000083
00000084

PetTalents_00000084
00000085

PetTalents_00000085
00000086

PetTalents_00000086
00000087

PetTalents_00000087
00000088

PetTalents_00000088
00000089

PetTalents_00000089
00000090

PetTalents_00000090
00000091

PetTalents_00000091
00000092

PetTalents_00000092
00000093

PetTalents_00000093
00000094

PetTalents_00000094
00000095

PetTalents_00000095
00000096

PetTalents_00000096
00000097

PetTalents_00000097
00000098

Add Health
00000099

Health Boost
00000100

Health Gift
00000101

Health Bounty
00000102

Extra Mana
00000103

Mana Boost
00000104

Mana Gift
00000105

Mana Bounty
00000106

Pip o'Plenty
00000107

Curse Giver
00000108

Feinting Spell
00000109

Plaguebringer
00000110

Infector
00000111

Sprite Time
00000112

Heart o'Pixie
00000113

Blade of Life
00000114

Spirit Armor
00000115

Bad Snowman
00000116

Blade of Ice
00000117

SnowBorn
00000118

Tower Shield
00000119

Big Sparky
00000120

Blade Flurry
00000121

Storm-Tooth
00000122

Disarmament
00000123

Elf on Fire
00000124

Power-Taker
00000125

Blade of Fire
00000126

Get Sunbird
00000127

Hexster
00000128

Feeling Weak
00000129

Power Player
00000130

Balanceblade
00000131

Mend Minion
00000132

Buff Minion
00000133

Go Humongo
00000134

PierceMonger
00000135

Death Aura
00000136

Storm Aura
00000137

Fire Aura
00000138

Snow Aura
00000139

Myth Aura
00000140

Life Trapper
00000141

Deathtrap
00000142

Stormtrap
00000143

Firetrap
00000144

Icetrap
00000145

Mythtrap
00000146

Lifeblade
00000147

Deathblade
00000148

Stormblade
00000149

Fireblade
00000150

Iceblade
00000151

Mythblade
00000152

Fairy Friend
00000153

Spritely
00000154

Sprite Queen
00000155

Unicorn
00000156

Imp Possible
00000157

Leprech-On
00000158

Guiding Light
00000159

Spriteshade
00000160

Groovy Ghoul
00000161

Send in the Scarecrow
00000162

Boom Snake
00000163

Shocking Bat
00000164

Tempest of Times
00000165

Fire Cat Ho!
00000166

Flaming Elf 
00000167

Meteor Strikes Back
00000168

Beetle Time
00000169

Snow 'n Tell
00000170

Begin the Blizzard
00000171

Bloodbatty
00000172

Troll Call
00000173

The Day the Earth Quaked
00000174

Beetlemania
00000175

Lead Stinger
00000176

Super Power Play
00000177

Guiding Light
00000178

Send in the Scarecrow
00000179

Tempest of Times
00000180

Meteor Strikes Back
00000181

Begin the Blizzard
00000182

The Day the Earth Quaked
00000183

Super Power Play
00000184

Pierce Train
00000185

Drop It
00000186

Life Shielded
00000187

Green Furry
00000188

Banshee Bop
00000189

Cloud Shark
00000190

Sunbird Call
00000191

Snow Biz
00000192

Call Cyclops
00000193

Cloud o'Bugs
00000194

PetTalents_00000194
00000195

Death-Eye
00000196

Death-Shot
00000197

Life-Eye
00000198

Life-Shot
00000199

Myth-Eye
00000200

Myth-Shot
00000201

Balance-Eye
00000202

Balance-It
00000203

Fire-Eye
00000204

Fire-Shot
00000205

Ice-Eye
00000206

Ice-Shot
00000207

Storm-Eye
00000208

Storm-Shot
00000209

Sharp-Eye
00000210

Sharp-Shot
00000211

May Cast #1:$Life_image$ Ward
00000212

May Cast #1:$Death_image$ Ward
00000213

May Cast #1:$Storm_image$ Ward
00000214

May Cast #1:$Fire_image$ Ward
00000215

May Cast #1:$Ice_image$ Ward
00000216

May Cast #1:$Myth_image$ Ward
00000217

May Cast #1:$Life_image$ Charm
00000218

May Cast "Deathblade" Spell
00000219

May Cast #1:$Storm_image$ Charm
00000220

May Cast #1:$Fire_image$ Charm
00000221

May Cast #1:$Ice_image$ Charm
00000222

May Cast #1:$Myth_image$ Charm
00000223

May Cast #1:$Life_image$ Spell
00000224

May Cast #1:$Death_image$ Spell
00000225

May Cast #1:$Storm_image$ Spell
00000226

May Cast #1:$Fire_image$ Spell
00000227

May Cast #1:$Ice_image$ Spell
00000228

May Cast #1:$Myth_image$ Spell
00000229

May Cast #1:$Balance_image$ Spell
00000230

Scaredy-Crow
00000231

Cup o'Storms
00000232

Strike! 
00000233

Ice Rider
00000234

Earthshaker
00000235

Power Up
00000236

Pip Boost
00000245

Fortify
00000246

Amplify
00000247

Infallible
00000248

Vengeance
00000249

Empowerment
00000250

Gobbler
00000251

Mander
00000252

Cat Bandit
00000253

Ninja Pig
00000254

Draconian
00000255

Treant
00000256

Colossus
00000257

Fire Elemental
00000258

Storm Elemental
00000259

Strong
00000260

Giant
00000261

Monstrous
00000262

Gargantuan
00000263

Keen Eyes
00000264

Accurate
00000265

Sniper
00000266

Unstoppable
00000267

May Cast #1:$Balance_image$ Charm
00000268

May Cast #1:$Balance_image$ Ward
00000269

May Cast #1:$Fire_image$, #2:$Ice_image$, #3:$Storm_image$ Ward
00000270

May Cast #1:$Fire_image$, #2:$Ice_image$, #3:$Storm_image$ Charm
00000271

May Cast #1:$Life_image$, #2:$Death_image$, #3:$Myth_image$ Charm
00000272

May Cast #1:$Life_image$, #2:$Death_image$, #3:$Myth_image$ Ward
00000273

May Cast #1:$Balance_image$ Charm
00000274

May Cast #1:$Death_image$ Ward
00000275

May Cast #1:$Death_image$ Charm
00000276

May Cast #1:$Death_image$ Ward
00000277

May Cast #1:$Death_image$ Spell
00000278

May Cast #1:$Death_image$ Charm
00000279

May Cast #1:$Fire_image$ Charm
00000280

May Cast #1:$Fire_image$ Spell
00000281

May Cast #1:$Fire_image$ Charm
00000282

May Cast #1:$Ice_image$ Ward
00000283

May Cast #1:$Ice_image$ Spell
00000284

May Cast #1:$Ice_image$ Charm
00000285

May Cast #1:$Life_image$ Charm
00000286

May Cast #1:$Myth_image$ Spell
00000287

May Cast #1:$Myth_image$ Charm
00000288

May Cast #1:$Myth_image$ Spell
00000289

May Cast #1:$Storm_image$ Spell
00000290

May Cast #1:$Storm_image$ Charm
00000291

May Cast #1:$Fire_image$ Spell
00000292

May Cast #1:$Storm_image$ Spell
00000293

May Cast #1:$Death_image$ Spell
00000294

May Cast #1:$Life_image$ Spell
00000295

May Cast #1:$Myth_image$ Spell
00000296

May Cast #1:$Myth_image$ Spell
00000297

May Cast #1:$Ice_image$ Spell
00000298

May Cast #1:$Ice_image$ Spell
00000299

May Cast #1:$Ice_image$ Spell
00000300

May Cast #1:$Ice_image$ Spell
00000301

May Cast #1:$Death_image$ Shield
00000302

May Cast #1:$Fire_image$ Shield
00000303

May Cast #1:$Fire_image$, #2:$Ice_image$, #3:$Storm_image$ Shields
00000304

May Cast "Tower Shield" Spell
00000305

May Cast "Cleanse Ward" Spell
00000306

May Cast #1:"Cleanse Charm" Spell
00000307

May Cast "Death Shield" Spell
00000308

May Cast "Fire Shield" Spell
00000309

May Cast "Elemental Shield" Spell
00000310

May Cast "Spirit Shield" Spell
00000311

May Cast "Storm Shield" Spell
00000312

May Cast "Life Shield" Spell
00000313

May Cast "Snow Shield" Spell
00000314

May Cast "Myth Shield" Spell
00000315

May Cast "Distract" Spell
00000316

May Cast "Mega Taunt" Spell
00000317

May Cast "Mega Tranquilize" Spell
00000318

May Cast "Calm" Spell
00000319

May Cast "Pacify" Spell
00000320

May Cast "Mega Subdue" Spell
00000321

May Cast "Mega Distract" Spell
00000322

May Cast "Mega Calm" Spell
00000323

May Cast "Freeze" Spell
00000324

May Cast "Mega Soothe" Spell
00000325

May Cast "Mega Pacify" Spell
00000326

May Cast "Beguile" Spell
00000327

May Cast "Steal Ward" Spell
00000328

May Cast "Steal Charm" Spell
00000329

May Cast "Tranquilize" Spell
00000330

May Cast "Stun" Spell
00000331

May Cast "Taunt" Spell
00000332

May Cast "Soothe" Spell
00000333

May Cast "Subdue" Spell
00000334

May Cast "Spirit Blade" Spell
00000335

May Cast "Lightning Strike" Spell
00000336

May Cast "Melt" Spell
00000337

May Cast "Plague" Spell
00000338

May Cast "Quench" Spell
00000339

May Cast "Strangle" Spell
00000340

May Cast "Smoke Screen" Spell
00000341

May Cast "Black Mantle" Spell
00000342

May Cast "Curse" Spell
00000343

May Cast "Unbalance" Spell
00000344

May Cast "Balanceblade" Spell
00000345

May Cast "Elemental Trap" Spell
00000346

May Cast "Elemental Blade" Spell
00000347

May Cast "Spirit Trap" Spell
00000348

May Cast "Dissipate" Spell
00000349

May Cast "Guiding Light" Spell
00000350

May Cast "Vaporize" Spell
00000351

May Cast "Hex" Spell
00000352

May Cast "Weakness" Spell
00000353

May Cast "Dragonblade" Spell
00000354

May Cast "Entangle" Spell
00000355

May Cast "Feint" Spell
00000356

May Cast "Scarab" Spell
00000357

May Cast "Scorpion" Spell
00000358

May Cast "Locust Swarm" Spell
00000359

May Cast "Power Play" Spell
00000360

May Cast "Dark Sprite" Spell
00000361

May Cast "Ghoul" Spell
00000362

May Cast "Banshee" Spell
00000363

May Cast "Scarecrow" Spell
00000364

May Cast "Fire Cat" Spell
00000365

May Cast "Fire Elf" Spell
00000366

May Cast "Sunbird" Spell
00000367

May Cast "Meteor Strike" Spell
00000368

May Cast "Frost Beetle" Spell
00000369

May Cast "Snow Serpent" Spell
00000370

May Cast "Evil Snowman" Spell
00000371

May Cast "Blizzard" Spell
00000372

May Cast "Imp" Spell
00000373

May Cast "Leprechaun" Spell
00000374

May Cast "Nature's Wrath" Spell
00000375

May Cast "Guiding Light" Spell
00000376

May Cast "Guidance" Spell
00000377

May Cast "Bloodbat" Spell
00000378

May Cast "Troll" Spell
00000379

May Cast "Cyclops" Spell
00000380

May Cast "Earthquake" Spell
00000381

May Cast "Thunder Snake" Spell
00000382

May Cast "Lightning Bats" Spell
00000383

May Cast "Storm Shark" Spell
00000384

May Cast "Tempest" Spell
00000385

May Cast "Death Trap" Spell
00000386

May Cast "Disarm" Spell
00000387

May Cast "Fireblade" Spell
00000388

May Cast "Fire Trap" Spell
00000389

May Cast "Fairy" Spell
00000390

May Cast "Sprite" Spell
00000391

May Cast Gardening "Pixie" Spell
00000392

May Cast "Iceblade" Spell
00000393

May Cast "Ice Trap" Spell
00000394

May Cast "Lifeblade" Spell
00000395

May Cast "Life Trap" Spell
00000396

May Cast "Unicorn" Spell
00000397

May Cast "Mythblade" Spell
00000398

May Cast "Myth Trap" Spell
00000399

May Cast "Pierce" Spell
00000400

May Cast "Stormblade" Spell
00000401

May Cast "Storm Trap" Spell
00000402

Death Shield
00000403

Fire Shield
00000404

Myth Shield
00000405

Snow Shield
00000406

Storm Shield
00000407

F. Elemental
00000408

S. Elemental
00000409

Go Humongo
00000410

May Cast "Cleanse Charm" Spell
00000411

Death Trap
00000412

Fire Trap
00000413

Ice Trap
00000414

Life Trap
00000415

Myth Trap
00000416

Storm Trap
00000417

Guidance
00000418

Screen
00000419

Life Shield
00000420

May Cast ""Life Shield"" Spell
00000421

May Cast ""Death Shield"" Spell
00000422

May Cast ""Storm Shield"" Spell
00000423

May Cast ""Fire Shield"" Spell
00000424

May Cast ""Snow Shield"" Spell
00000425

May Cast ""Myth Shield"" Spell
00000426

May Cast ""Life Trap"" Spell
00000427

May Cast ""Death Trap"" Spell
00000428

May Cast ""Storm Trap"" Spell
00000429

May Cast ""Fire Trap"" Spell
00000430

May Cast ""Ice Trap"" Spell
00000431

May Cast ""Myth Trap"" Spell
00000432

May Cast ""Lifeblade"" Spell
00000433

May Cast ""Deathblade"" Spell
00000434

May Cast ""Stormblade"" Spell
00000435

May Cast ""Fireblade"" Spell
00000436

May Cast ""Iceblade"" Spell
00000437

May Cast ""Mythblade"" Spell
00000438

May Cast ""Fairy"" Spell
00000439

May Cast ""Sprite"" Spell
00000440

May Cast ""Sprite Queen"" Spell
00000441

May Cast ""Unicorn"" Spell
00000442

May Cast ""Pierce"" Spell
00000443

May Cast ""Disarm"" Spell
00000444

Element Trap
00000445

May Cast ""Elemental Trap"" Spell
00000446

Spirit Trap
00000447

May Cast ""Spirit Trap"" Spell
00000448

Feint
00000449

May Cast ""Feint"" Spell
00000450

Hex
00000451

May Cast ""Hex"" Spell
00000452

Weakness
00000453

May Cast ""Weakness"" Spell
00000454

Curse
00000455

May Cast ""Curse"" Spell
00000456

Plague
00000457

May Cast ""Plague"" Spell
00000458

Dragonblade
00000459

May Cast ""Dragonblade"" Spell
00000460

May Cast ""Balanceblade"" Spell
00000461

Element Blade
00000462

May Cast ""Elemental Blade"" Spell
00000463

Spirit Blade
00000464

May Cast ""Spirit Blade"" Spell
00000465

May Cast ""Guiding Light"" Spell
00000466

May Cast ""Tower Shield"" Spell
00000467

Element Shield
00000468

May Cast ""Elemental Shield"" Spell
00000469

Spirit Shield
00000470

May Cast ""Spirit Shield"" Spell
00000471

Freeze
00000472

May Cast ""Freeze"" Spell
00000473

Stun
00000474

May Cast ""Stun"" Spell
00000475

Beguile
00000476

May Cast ""Beguile"" Spell
00000477

Black Mantle
00000478

May Cast ""Black Mantle"" Spell
00000479

Smoke Screen
00000480

May Cast ""Smoke Screen"" Spell
00000481

Light Strike
00000482

May Cast ""Light Strike"" Spell
00000483

Steal Charm
00000484

May Cast ""Steal Charm"" Spell
00000485

Steal Ward
00000486

May Cast ""Steal Ward"" Spell
00000487

Clean Ward
00000488

May Cast ""Clean Ward"" Spell
00000489

Clean Charm
00000490

May Cast ""Clean Charm"" Spell
00000491

Unbalance
00000492

May Cast ""Unbalance"" Spell
00000493

Strangle
00000494

May Cast ""Strangle"" Spell
00000495

Quench
00000496

May Cast ""Quench"" Spell
00000497

Melt
00000498

May Cast ""Melt"" Spell
00000499

Entangle
00000500

May Cast ""Entangle"" Spell
00000501

Vaporize
00000502

May Cast ""Vaporize"" Spell
00000503

Dissipate
00000504

May Cast ""Dissipate"" Spell
00000505

Taunt
00000506

May Cast ""Taunt"" Spell
00000507

Distract
00000508

May Cast ""Distract"" Spell
00000509

Subdue
00000510

May Cast ""Subdue"" Spell
00000511

Tranquilize
00000512

May Cast ""Tranquilize"" Spell
00000513

Soothe
00000514

May Cast ""Soothe"" Spell
00000515

Pacify
00000516

May Cast ""Pacify"" Spell
00000517

Calm
00000518

May Cast ""Calm"" Spell
00000519

Mega Taunt
00000520

May Cast ""Mega Taunt"" Spell
00000521

Mega Distract
00000522

May Cast ""Mega Distract"" Spell
00000523

Mega Subdue
00000524

May Cast ""Mega Subdue"" Spell
00000525

Mega Tranquilize
00000526

May Cast ""Mega Tranquilize"" Spell
00000527

Mega Soothe
00000528

May Cast ""Mega Soothe"" Spell
00000529

Mega Pacify
00000530

May Cast ""Mega Pacify"" Spell
00000531

Mega Calm
00000532

May Cast ""Mega Calm"" Spell
00000533

May Cast ""Imp"" Spell
00000534

May Cast ""Leprechaun"" Spell
00000535

May Cast ""Nature's Wrath"" Spell
00000536

May Cast ""Guidance"" Spell
00000537

May Cast ""Dark Sprite"" Spell
00000538

May Cast ""Ghoul"" Spell
00000539

May Cast ""Banshee"" Spell
00000540

May Cast ""Scarecrow"" Spell
00000541

May Cast ""Thunder Snake"" Spell
00000542

May Cast ""Lightning Bats"" Spell
00000543

May Cast ""Storm Shark"" Spell
00000544

May Cast ""Tempest"" Spell
00000545

May Cast ""Fire Cat"" Spell
00000546

May Cast "Fire Elf" Spell
00000547

May Cast ""Sunbird"" Spell
00000548

May Cast ""Meteor Strike"" Spell
00000549

May Cast ""Frost Beetle"" Spell
00000550

May Cast ""Snow Serpent"" Spell
00000551

May Cast ""Evil Snowman"" Spell
00000552

May Cast ""Blizzard"" Spell
00000553

May Cast ""Bloodbat"" Spell
00000554

May Cast ""Troll"" Spell
00000555

May Cast ""Cyclops"" Spell
00000556

May Cast ""Earthquake"" Spell
00000557

May Cast ""Scarab"" Spell
00000558

May Cast ""Scorpion"" Spell
00000559

May Cast ""Locust Swarm"" Spell
00000560

May Cast ""Power Play"" Spell
00000561

Balance Caller
00000562

Myth Caller
00000563

Death Caller
00000564

Life Caller
00000565

Ice Caller
00000566

Fire Caller
00000567

Storm Caller
00000568

Death-Ward
00000569

Life-Ward
00000570

Myth-Ward
00000571

Balance-Ward
00000572

Fire-Ward
00000573

Ice-Ward
00000574

Storm-Ward
00000575

Death-Dealer
00000576

Life-Bringer
00000577

Myth-Dealer
00000578

Balance-Dealer
00000579

Fire-Dealer
00000580

Ice-Dealer
00000581

Storm-Dealer
00000582

Death-Sniper
00000583

Life-Sniper
00000584

Myth-Sniper
00000585

Balance-Sniper
00000586

Fire-Sniper
00000587

Ice-Sniper
00000588

Storm-Sniper
00000589

May Cast "Amplify" Spell
00000590

May Cast "Fortify" Spell
00000591

May Cast "Infallible" Spell
00000592

May Cast "Vengeance" Spell
00000593

May Cast "Empowerment" Spell
00000594

May Cast "Conviction" Spell
00000595

May Cast "Berserk" Spell
00000596

May Cast "Mend" Spell
00000597

Batusi
00000598

May Cast "Lifebat" Spell
00000599

Evil Eye
00000600

May Cast "Doom and Gloom" Spell
00000601

Green Thumb
00000602

May Cast "Sanctuary" Spell
00000603

Storm Front
00000604

May Cast "Darkwind" Spell
00000605

Pyromania
00000606

May Cast "Wyldfire" Spell
00000607

Might of Myth
00000608

May Cast "Time of Legend" Spell
00000609

Wall of Confusion
00000610

May Cast "Weaken Magic" Spell
00000611

Boss Toad
00000612

Blazing Oak
00000613

Button Tom
00000614

The Deer Knight Rises
00000615

Mulligan's Shuffle
00000616

Stormclaw
00000617

Berserk
00000618

Conviction
00000619

Mend
00000620

Bullheaded
00000621

Clock Spider
00000622

Greensleeves
00000623

Crystallize
00000624

No Pain, No Gain
00000625

Brown Recluse
00000626

Black Widow
00000627

Rage of Winter
00000628

Armor Piercer
00000629

Armor Breaker
00000630

Critical Hitter
00000631

Critical Striker
00000632

Blocker
00000633

Defender
00000634

Healer
00000635

Medic
00000636

Healthy
00000637

Lively
00000638

Stun Resistant
00000639

Stun Recalcitrant
00000640

Biting Cold
00000641

May Cast "Balefrost" Spell
00000642

Grand Phoenix
00000643

May Cast "Windstorm" Spell
00000644

Thunder Lizard
00000645

Pyrosaurus Rex
00000646

Blizzard Lizard
00000648

Time Skip
00000649

Char Lizard
00000650

Spartan
00000651

Spartan
00000652

Balance Striker
00000653

Balance Assailant
00000654

Storm Striker
00000655

Storm Assailant
00000656

Fire Striker
00000657

Fire Assailant
00000658

Ice Striker
00000659

Ice Assailant
00000660

Myth Striker
00000661

Myth Assailant
00000662

Life Striker
00000663

Life Assailant
00000664

Death Striker
00000665

Death Assailant
00000666

DOT Doctor
00000667

May Cast "Triage" Spell
00000668

Tick Kicker
00000669

May Cast "Cooldown" Spell
00000670

Energizing Battery
00000671

May Cast "Healing Current" Spell
00000672

Dragonspear
00000673

May Cast "Dragonspear" Spell
00000674

Charm Chopper
00000675

May Cast "Enfeeble" Spell
00000676

Ward Wrecker
00000677

May Cast "Shatter" Spell
00000678

Cure Crusher
00000679

May Cast "Infection" Spell
00000680

Snow Heal For You!
00000681

May Cast "Snow Drift" Spell
00000682

Fuel
00000683

May Cast "Fuel" Spell
00000684

May Cast "Legion Shield" Spell
00000685

May Cast "Shield Minion" Spell
00000686

May Cast "Buff Minion" Spell
00000687

Sap Health
00000688

May Cast "Sword and Shield" Spell
00000689

Spritely 100% - DNU
00000690

Steal Health
00000691

Animate Skeleton
00000692

Life Fuel
00000693

May Cast "Life Fuel" Spell
00000694

Myth Fuel
00000695

May Cast "Myth Fuel" Spell
00000696

May Cast "Galvanic Field" Spell
00000697

May Cast "Furnace" Spell
00000698

May Cast "Sleet Storm" Spell
00000699

May Cast "Reliquary" Spell
00000700

May Cast "Virulence" Spell
00000701

May Cast "Cycle of Life" Spell
00000702

May Cast "Chastisement" Spell
00000703

May Cast "Punishment" Spell
00000704

Stormspear
00000705

May Cast "Stormspear" Spell
00000706

Firespear
00000707

May Cast "Firespear" Spell
00000708

Icespear
00000709

May Cast "Icespear" Spell
00000710

Mythspear
00000711

May Cast "Mythspear" Spell
00000712

Lifespear
00000713

May Cast "Lifespear" Spell
00000714

Deathspear
00000715

May Cast "Deathspear" Spell
00000716

May Cast "Balancespear" Spell
00000717

Aura Crush
00000718

Gardening Pixie
00000719

May Cast Gardening "Pixie" Spell
00000720

Reveal Fish School
00000721

May Cast Fishing "Reveal Fish School" Spell
00000722

May Cast "Stun Block" on an ally
00000723

May Cast "Glacial Shield" on ally
00000724

May Cast "Ether Shield" on ally
00000725

May Cast "Legend Shield" on ally
00000726

May Cast "Spirit Shield" on ally
00000727

May Cast "Precision" on ally
00000728

May Cast "Elemental Shield" on ally
00000729

May Cast "Tower Shield" on ally
00000730

May Cast "Volcanic Shield" on ally
00000731

May Cast "Thermic Shield" on ally
00000732

May Cast "Dream Shield" on ally
00000733

May Cast "Dragonblade" on ally
00000734

May Cast "Devotion" Spell
00000735

May Cast "Sprite Queen" Spell
